{"keras_version": "2.0.4", "backend": "tensorflow", "config": {"layers": [{"name": "input_1", "inbound_nodes": [], "config": {"name": "input_1", "sparse": false, "batch_input_shape": [null, 28, 28, 1], "dtype": "float32"}, "class_name": "InputLayer"}, {"name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_1", "trainable": true, "padding": "same", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "filters": 16, "use_bias": true, "activation": "relu", "kernel_constraint": null, "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"name": "max_pooling2d_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"name": "max_pooling2d_1", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "padding": "same", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"name": "conv2d_2", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_2", "trainable": true, "padding": "same", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "filters": 8, "use_bias": true, "activation": "relu", "kernel_constraint": null, "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"name": "max_pooling2d_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"name": "max_pooling2d_2", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "padding": "same", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"name": "conv2d_3", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_3", "trainable": true, "padding": "same", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "filters": 8, "use_bias": true, "activation": "relu", "kernel_constraint": null, "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"name": "max_pooling2d_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"name": "max_pooling2d_3", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "padding": "same", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"name": "conv2d_4", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_4", "trainable": true, "padding": "same", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "filters": 8, "use_bias": true, "activation": "relu", "kernel_constraint": null, "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"name": "up_sampling2d_1", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"name": "up_sampling2d_1", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "class_name": "UpSampling2D"}, {"name": "conv2d_5", "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}]]], "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_5", "trainable": true, "padding": "same", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "filters": 8, "use_bias": true, "activation": "relu", "kernel_constraint": null, "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"name": "up_sampling2d_2", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"name": "up_sampling2d_2", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "class_name": "UpSampling2D"}, {"name": "conv2d_6", "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}]]], "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_6", "trainable": true, "padding": "valid", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "filters": 16, "use_bias": true, "activation": "relu", "kernel_constraint": null, "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"name": "up_sampling2d_3", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"name": "up_sampling2d_3", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "class_name": "UpSampling2D"}, {"name": "conv2d_7", "inbound_nodes": [[["up_sampling2d_3", 0, 0, {}]]], "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_7", "trainable": true, "padding": "same", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "filters": 1, "use_bias": true, "activation": "sigmoid", "kernel_constraint": null, "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}], "name": "model_1", "output_layers": [["conv2d_7", 0, 0]], "input_layers": [["input_1", 0, 0]]}, "class_name": "Model"}