{"keras_version": "2.0.4", "class_name": "Model", "backend": "tensorflow", "config": {"input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 28, 28, 1], "sparse": false, "dtype": "float32", "name": "input_1"}}, {"name": "conv2d_1", "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"trainable": true, "dilation_rate": [1, 1], "name": "conv2d_1", "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "filters": 16, "strides": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "activation": "relu", "kernel_size": [3, 3], "data_format": "channels_last"}}, {"name": "max_pooling2d_1", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_1", "padding": "same", "strides": [2, 2]}}, {"name": "conv2d_2", "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"trainable": true, "dilation_rate": [1, 1], "name": "conv2d_2", "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "filters": 8, "strides": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "activation": "relu", "kernel_size": [3, 3], "data_format": "channels_last"}}, {"name": "max_pooling2d_2", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_2", "padding": "same", "strides": [2, 2]}}, {"name": "conv2d_3", "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"trainable": true, "dilation_rate": [1, 1], "name": "conv2d_3", "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "filters": 8, "strides": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "activation": "relu", "kernel_size": [3, 3], "data_format": "channels_last"}}, {"name": "max_pooling2d_3", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_3", "padding": "same", "strides": [2, 2]}}, {"name": "conv2d_4", "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "config": {"trainable": true, "dilation_rate": [1, 1], "name": "conv2d_4", "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "filters": 8, "strides": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "activation": "relu", "kernel_size": [3, 3], "data_format": "channels_last"}}, {"name": "up_sampling2d_1", "class_name": "UpSampling2D", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling2d_1", "size": [2, 2]}}, {"name": "conv2d_5", "class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}]]], "config": {"trainable": true, "dilation_rate": [1, 1], "name": "conv2d_5", "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "filters": 8, "strides": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "activation": "relu", "kernel_size": [3, 3], "data_format": "channels_last"}}, {"name": "up_sampling2d_2", "class_name": "UpSampling2D", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling2d_2", "size": [2, 2]}}, {"name": "conv2d_6", "class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}]]], "config": {"trainable": true, "dilation_rate": [1, 1], "name": "conv2d_6", "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "filters": 16, "strides": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "activation": "relu", "kernel_size": [3, 3], "data_format": "channels_last"}}, {"name": "up_sampling2d_3", "class_name": "UpSampling2D", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling2d_3", "size": [2, 2]}}, {"name": "conv2d_7", "class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_3", 0, 0, {}]]], "config": {"trainable": true, "dilation_rate": [1, 1], "name": "conv2d_7", "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "filters": 1, "strides": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "activation": "sigmoid", "kernel_size": [3, 3], "data_format": "channels_last"}}], "output_layers": [["conv2d_7", 0, 0]], "name": "model_1"}}