{"keras_version": "2.0.4", "backend": "tensorflow", "config": {"output_layers": [["conv2d_7", 0, 0]], "input_layers": [["input_1", 0, 0]], "layers": [{"inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 28, 28, 1], "name": "input_1", "dtype": "float32"}, "name": "input_1", "class_name": "InputLayer"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "activation": "relu", "kernel_constraint": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "filters": 16, "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "use_bias": true, "dilation_rate": [1, 1], "name": "conv2d_1", "kernel_regularizer": null}, "name": "conv2d_1", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"padding": "same", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_1"}, "name": "max_pooling2d_1", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "activation": "relu", "kernel_constraint": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "filters": 8, "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "use_bias": true, "dilation_rate": [1, 1], "name": "conv2d_2", "kernel_regularizer": null}, "name": "conv2d_2", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"padding": "same", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_2"}, "name": "max_pooling2d_2", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "activation": "relu", "kernel_constraint": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "filters": 8, "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "use_bias": true, "dilation_rate": [1, 1], "name": "conv2d_3", "kernel_regularizer": null}, "name": "conv2d_3", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"padding": "same", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_3"}, "name": "max_pooling2d_3", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "config": {"bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "activation": "relu", "kernel_constraint": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "filters": 8, "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "use_bias": true, "dilation_rate": [1, 1], "name": "conv2d_4", "kernel_regularizer": null}, "name": "conv2d_4", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"trainable": true, "size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_1"}, "name": "up_sampling2d_1", "class_name": "UpSampling2D"}, {"inbound_nodes": [[["up_sampling2d_1", 0, 0, {}]]], "config": {"bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "activation": "relu", "kernel_constraint": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "filters": 8, "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "use_bias": true, "dilation_rate": [1, 1], "name": "conv2d_5", "kernel_regularizer": null}, "name": "conv2d_5", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"trainable": true, "size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_2"}, "name": "up_sampling2d_2", "class_name": "UpSampling2D"}, {"inbound_nodes": [[["up_sampling2d_2", 0, 0, {}]]], "config": {"bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "activation": "relu", "kernel_constraint": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "filters": 16, "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "use_bias": true, "dilation_rate": [1, 1], "name": "conv2d_6", "kernel_regularizer": null}, "name": "conv2d_6", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"trainable": true, "size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_3"}, "name": "up_sampling2d_3", "class_name": "UpSampling2D"}, {"inbound_nodes": [[["up_sampling2d_3", 0, 0, {}]]], "config": {"bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "activation": "sigmoid", "kernel_constraint": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "filters": 1, "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "use_bias": true, "dilation_rate": [1, 1], "name": "conv2d_7", "kernel_regularizer": null}, "name": "conv2d_7", "class_name": "Conv2D"}], "name": "model_1"}, "class_name": "Model"}